// pages/doctor/doctor.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    docotorList:[
      {
        "img":"http://img5.imgtn.bdimg.com/it/u=1284669865,105431302&fm=26&gp=0.jpg",
        "title":"艾灸保健的几个灸法",
        "titledetail":"【导读】艾灸的养生作用十分的丰富，既可以激发和提高人体的免疫功能，又可以温经散寒、扶正祛邪、通经活络，受到医家的重视，艾灸保健的几个灸法你应该须知，来..."
      },
      {
        "img": "http://img0.imgtn.bdimg.com/it/u=3932415688,4068915486&fm=26&gp=0.jpg",
        "title": "按摩可以调理气血",
        "titledetail": "【导读】亚健康一度成为热门话题，如何养气更值得一提，因为很多人都会出现气血不足，你知道按摩可以调理气血吗？不知道小编就在下面介绍按摩可以调理气血的原因..."
      },
      {
        "img": "http://img2.imgtn.bdimg.com/it/u=878586800,2088690888&fm=15&gp=0.jpg",
        "title": "刺激部位可以延寿",
        "titledetail": "【导读】按摩一直被认为养生保健的方法，身体只要健康了，寿命自然就会延长。今天小编就教大家几个刺激部位可以延寿的方法，来好好来学学刺激部位可以延寿吧。..."
      },
      {
        "img": "http://img0.imgtn.bdimg.com/it/u=1181145939,2605893567&fm=26&gp=0.jpg",
        "title": "经络养生 活络气血的秘诀",
        "titledetail": "【导读】经络养生,活络气血的秘诀！什么季节都要关注。那么什么样的养生方式最好呢？女人如何进行自我身体的调理，我们来看看最受推崇的经络养生法，能让女人舒缓..."
      },
      {
        "img": "http://img3.imgtn.bdimg.com/it/u=3166602098,2754457763&fm=26&gp=0.jpg",
        "title": "埋针治颈椎病神效",
        "titledetail": "【导读】“埋针法”是以特制的小型针具刺入并固定于穴位皮内或皮下，通过微弱而较长时间的刺激，达到防治疾病的目的，也叫皮内针刺法，所以埋针治颈椎病神效，下..."
      },
      {
        "img": "http://img4.imgtn.bdimg.com/it/u=3809297116,79111800&fm=26&gp=0.jpg",
        "title": "女人美容强身的12大穴位",
        "titledetail": "【导读】如今女人美容不仅仅是靠整形的，懂得中医的人就会利用经络养生美容。女人美容强身的12大穴位你知道在哪吗？掌握女人经络养生的穴位，可以治疗身体上的很..."
      },
      {
        "img": "http://img5.imgtn.bdimg.com/it/u=2776463586,3707418735&fm=26&gp=0.jpg",
        "title": "人体各穴道的用途",
        "titledetail": "【导读】人体各穴道的用途是长寿的重要点。每个人都想长寿，每个人都想有强健的体魄，当我们在电视上看到百岁村的人都能如此长寿，我们是什么感觉呢？难道我们只..."
      }
      ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})